CSI API ETABS v1

# cLoadCasesBuckling Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseBuckling Buckling { get; }

    ReadOnly Property Buckling As cCaseBuckling
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseBuckling

    value = instance.Buckling

    property cCaseBuckling^ Buckling {
    	cCaseBuckling^ get ();
    }

    abstract Buckling : cCaseBuckling with get

#### Property Value

Type: cCaseBuckling

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com